import os
from config import admin_id
from aiogram.types import Message
from create_bot import dp, bot


'''***********************************СЛУЖЕБНАЯ ЧАСТЬ********************************************************'''
async def send_to_admin(dp):
    print('Вывод служебной информации: подключение к БД и тп')
    try:
        await bot.send_message(chat_id=os.getenv('admin_id'), text="Бот запущен")
    except:
        await bot.send_message(chat_id=admin_id, text="Бот запущен")
'''**********************************************************************************************************'''








'''***********************************ОСНОВНАЯ ЧАСТЬ*********************************************************'''
'''**********************************************************************************************************'''
'''***********************************ЗАПУСК ФУНКЦИЙ*********************************************************'''
'''**********************************************************************************************************'''